Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedLoad Methods
The AnalysisDecomposedLoad type exposes the following members.
Methods
Name | Description
Select
 Selects an analysis object from the database.
 (Inherited from AnalysisObject.)
Top
See Also
Reference
AnalysisDecomposedLoad Class
Tekla.Structures.Analysis Namespace